In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('new_full_student_data.csv')

In [12]:
df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [13]:
df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [16]:
df = df.dropna()

df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [17]:
df.duplicated().sum()

1836

In [19]:
df = df.drop_duplicates()
df.duplicated().sum()

0

In [20]:
df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [21]:
df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [22]:
df['grade'] = df['grade'].str.replace('th', '') 
df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [23]:
df['grade'] = df['grade'].astype(int)
df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [24]:
df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [25]:
mean_math_Score = df["math_score"].mean()
mean_math_Score

64.67573326141189

In [26]:
min_reading_score = df['reading_score'].min()
min_reading_score

10.5

In [27]:
df.loc[:, ["grade"]]

       grade
0          9
1          9
2          9
3          9
5          9
...      ...
19508     10
19509     12
19511     11
19512     11
19513     12

[14831 rows x 1 columns]

In [28]:
df.iloc[0:3 , [3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [29]:
grade_nine_summary = df.loc[df["grade"] == 9]
grade_nine_summary.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [30]:
min_reading_row = df.loc[df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [31]:
dixon_tenth_reading = df.loc[(df["grade"] == 10) & (df["reading_score"] > 0) & (df["school_name"] == "Dixon High School")]
dixon_tenth_reading.iloc[:, [2,3,4]]

       grade        school_name  reading_score
45        10  Dixon High School           71.1
60        10  Dixon High School           59.5
69        10  Dixon High School           88.6
94        10  Dixon High School           81.5
100       10  Dixon High School           95.3
...      ...                ...            ...
19283     10  Dixon High School           52.9
19306     10  Dixon High School           58.0
19344     10  Dixon High School           38.0
19368     10  Dixon High School           84.4
19445     10  Dixon High School           43.9

[569 rows x 3 columns]

In [32]:
df.loc[df["grade"] >= 11, "reading_score"].mean()

74.90038089192188

In [33]:
average_scores_by_school_type = df.groupby(by="school_type").mean()
average_scores_by_school_type.loc[:, ["reading_score", "math_score"]]

             reading_score  math_score
school_type
Charter          72.450603   66.761883
Public           72.281219   62.951576

In [34]:
avg_budget_by_school_type = df.groupby(['school_type']).mean()
avg_budget_by_school_type.loc[:, ['school_budget']]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [35]:
student_count = df[['school_name', 'student_id']].groupby(by = 'school_name').count()
student_count.sort_values(by='student_id', ascending=False)

                        student_id
school_name
Montgomery High School        2038
Green High School             1961
Dixon High School             1583
Wagner High School            1541
Silva High School             1109
Woods High School             1052
Sullivan High School           971
Turner High School             846
Bowers High School             803
Fisher High School             798
Richard High School            551
Campos High School             541
Odonnell High School           459
Campbell High School           407
Chang High School              171

In [36]:
avg_math_by_school_grade = df.groupby(['school_type', 'grade']).mean().round()
avg_math_by_school_grade.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9            70.0
            10           66.0
            11           68.0
            12           60.0
Public      9            64.0
            10           64.0
            11           59.0
            12           64.0

In [ ]:
# Findings 

# Overall students had a tendency of preforming better in the reading exam than in the math exam. 
# When we exaimne the test scores for Charter & Public schools we discovered that the Charter schools tested higher in both exams. 
# I think taking a closer look at the budget would be helpful as well. Budget based on school could also play a part in influence on exam scores.